# Week 8 Pandas Basic

## Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [5]:
import pandas as pd
series = pd.Series([4, 8, 15, 16, 23,42])
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

## Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it

In [6]:
l = [0,1,2,3,4,5,6,7,8,9]
s = pd.Series(l)
print(s)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

## Q3. Create a Pandas DataFrame that contains the following data:

In [8]:
df = pd.DataFrame({'Name' : ['Alic','Bob','Claire'],
                   'Age' : [25,30,27],
                   'Gender' : ['Female','Male','Female']})

df

     Name  Age  Gender
0    Alic   25  Female
1     Bob   30    Male
2  Claire   27  Female

## Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

### DataFrame
DataFrame is a two dimensional data structure, just like any table, which contains rows and columns. It can store data of various types and can perform various functions on it. It can be seen as collection of series.

### Series
pandas.series or Series is one dimensional data structure with indexes that can be used to label and access data entries. It can be seen as single column of data or single row in a  DataFrame.

In [34]:
# DataFrame
df = pd.DataFrame({'Name' : ['Alice','Bob','Claire'],
                   'Age' : [25,30,27],
                   'Gender' : ['Female','Male','Female']})
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [13]:
# Series
df['Age']

0    25
1    30
2    27
Name: Age, dtype: int64

## Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

There are bunch of many functions that can be used to manipulate data in Pandas DataFrame. Some of them are : 

* head() and tail(): 
* info()
* describe()
* sort_values()
* groupby()
* drop()
* fillna()
  
  
These functions can be used in different scenarios : 
* If we want to retrieve first 5 entries of datafram, we use:  df.head()
* If I need to sort data on basis of alphabets or age, we use : df.sort_values()
* If we need to groupify enteries, we use : df.group_by()
* lets say we need to delete some row or column, we use : df.drop()
* Suppose we need to fill missing values, we use : df.fillna()
* df.describe() is used to get various statistical measures.

In [21]:
df = pd.DataFrame({'Name' : ['Maninder','Virant','Aman','Shubham','Garvit','Gautam'],
                   'Age' : [20,19, 18 ,21,20,18],
                   'City' : ['Patiala','Panipat','Karnal','Brampton','Ontario','Rajpura']
}
)

In [22]:
df.head()

       Name  Age      City
0  Maninder   20   Patiala
1    Virant   19   Panipat
2      Aman   18    Karnal
3   Shubham   21  Brampton
4    Garvit   20   Ontario

In [23]:
df.sort_values('Age')

       Name  Age      City
2      Aman   18    Karnal
5    Gautam   18   Rajpura
1    Virant   19   Panipat
0  Maninder   20   Patiala
4    Garvit   20   Ontario
3   Shubham   21  Brampton

In [27]:
df.groupby('Age').sum()

               Name            City
Age
18       AmanGautam   KarnalRajpura
19           Virant         Panipat
20   ManinderGarvit  PatialaOntario
21          Shubham        Brampton

In [29]:
df.drop('Age',axis = 1)

       Name      City
0  Maninder   Patiala
1    Virant   Panipat
2      Aman    Karnal
3   Shubham  Brampton
4    Garvit   Ontario
5    Gautam   Rajpura

In [30]:
df.describe()

             Age
count   6.000000
mean   19.333333
std     1.211060
min    18.000000
25%    18.250000
50%    19.500000
75%    20.000000
max    21.000000

## Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Among Series, DataFrame and Panel, Series and DataFrame are mutable while Panel is ummutable.

+ Series  : It is mutable in nature as we change modify the data cotents after creation of series.
+ DataFrame : It is also mutable that means we can change or alter data after the creation of dataframe
+ Panel : Panel is ummutable, so we cannot change anything after we creat it

## Q7. Create a DataFrame using multiple Series. Explain with an example.

In [32]:
name = pd.Series(['Maninder','Virant','Aman','Shubham',])
age = pd.Series([20,19, 18 ,21,])
city = pd.Series(['Patiala','Panipat','Karnal','Brampton'])



df = pd.DataFrame({'Name' : name,
                   'Age' : age,
                   'City' : city
})

In [33]:
df

       Name  Age      City
0  Maninder   20   Patiala
1    Virant   19   Panipat
2      Aman   18    Karnal
3   Shubham   21  Brampton

In above example, I created series named (name,age,city) and then passed them to pd.DataFrame() to create a DataFrame.